# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed_FasterNet, [96, 4, 4]]  # 0-P1/4
  - [-1, 1, BasicStage, [96, 1]]  # 1
  - [-1, 1, PatchMerging_FasterNet_ContextGuided, [192]]  # 2-P2/8
  - [-1, 2, BasicStage, [192, 1]]  # 3-P3/16
#  - [-1, 1, RFCBAMConv, []] # 4
  - [-1, 1, PatchMerging_FasterNet_ContextGuided, [394]]  # 4
  - [-1, 8, BasicStage, [394, 1]]  # 5-P4/32
#  - [-1, 1, RFCBAMConv, []] # 7
  - [-1, 1, PatchMerging_FasterNet_ContextGuided, [788]] # 6
  - [-1, 2, BasicStage, [788, 1]] # 7 9 7
  - [-1, 1, RFCBAMConv, []] # 10 8
  - [-1, 1, SPPF, [788, 5]]  # 8 11 9


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12 10
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4 13 11
  - [-1, 1, VoVDualCSP, [512]]  # 11 14 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 13
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3 16 14
  - [-1, 1, VoVDualCSP, [256]]  # 14 (P3/8-small) 17 15

  - [-1, 1, Conv, [256, 3, 2]] # 18 16
  - [[-1, 12], 1, Concat, [1]]  # cat head P4 19 17
  - [-1, 1, VoVDualCSP, [512]]  # 17 (P4/16-medium) 20 18

  - [-1, 1, Conv, [512, 3, 2]] # 21 19
  - [[-1, 9], 1, Concat, [1]]  # cat head P5 22 20
  - [-1, 1, VoVDualCSP, [1024]]  # 20 (P5/32-large) 23 21

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)